In [125]:
import pandas as pd

In [126]:
data=[[1 , 2 , 3] ,
       [4 , 5 , 6] ,
       [7, 8 , 9 ]]

In [127]:
list('321')

['3', '2', '1']

In [128]:
pd.DataFrame(data)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [129]:
df = pd.DataFrame(data , list('321') , list('zyx'))

In [130]:
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9

In [131]:
df.sort_index(inplace= True)
df

   z  y  x
1  7  8  9
2  4  5  6
3  1  2  3

In [132]:
df.sort_index(inplace= True, axis =1)
df

   x  y  z
1  9  8  7
2  6  5  4
3  3  2  1

In [133]:
df.sort_values (['x','y','z'] , inplace= True )
df

   x  y  z
3  3  2  1
2  6  5  4
1  9  8  7

In [134]:
df.sort_values ( by = '3' , axis = 1, inplace= True )
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9

In [135]:
index= ['Gabriel', 'Nepomuceno' , 'Bispo']
index

['Gabriel', 'Nepomuceno', 'Bispo']

In [149]:
gogo = ['Top' + chr(i+97) for i in range(3)]
gogo

['Topa', 'Topb', 'Topc']

In [150]:
df5 = pd.DataFrame (data= data , index = index , columns= gogo)
df5

            Topa  Topb  Topc
Gabriel        1     2     3
Nepomuceno     4     5     6
Bispo          7     8     9